import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'news-inner',
  templateUrl: './news-inner.component.html',
  styleUrls: ['./news-inner.component.scss']
})
export class NewsInnerComponent implements OnInit {

  newsItem = 
  {
    id: "1",
    imageUrl: "assets/images/trips-banner.jpg",
    title: "بخماسي أجنبي.. الزمالك يعلن قائمته لمونديال الأندية لكرة السلة",
    actor: "نقابة المهندسين",
    date: "12 يناير 2022",
    description: "لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار رقائق ليتراسيت (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل ألدوس بايج مايكر (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار رقائق “ليتراسيت” (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل “ألدوس بايج مايكر” (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار رقائق “ليتراسيت” (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل “ألدوس بايج مايكر” (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم إيبسوم.لوريم إيبسوم.لوريم إيبسوم.",
    newsName: "المصرى اليوم"
  }; 

  breadcrumb = [
    {
      id: 1,
      title: "الرئيسية",
      route: "/home"
    },
    {
      id: 2,
      title: "الأخبار",
      route: "/news"
    },
    {
      id: 3,
      title: "تفاصيل الخبر",
      route: "/news/1"
    }
  ]

  constructor() { }

  ngOnInit(): void {
  }

}
